In [7]:
import sqlite3

In [8]:
connection = sqlite3.connect('example2.db')

In [9]:
cursor = connection.cursor()

In [10]:
cursor.execute('''
        create table employee(
        employee_id int primary key,
        name varchar(30),
        age int,
        salary float
        )
''')

connection.commit()

In [11]:
cursor.execute('''
       select * from employee
''')

In [12]:
cursor.execute('''
        insert into employee
        values
        (101,'sumit',20,20000),
        (102,'suryansh',23,40000)
''')

connection.commit()

In [13]:
cursor.execute('Select * from employee')
rows = cursor.fetchall()

for row in rows:
    print(row)

(101, 'sumit', 20, 20000.0)
(102, 'suryansh', 23, 40000.0)

In [14]:
cursor.execute('''
    update employee
    set age = 30
    where age < 25
''')

connection.commit()

In [18]:
cursor.execute('Select * from employee')
rows = cursor.fetchall()

for row in rows:
    print(row)

(101, 'sumit', 30, 20000.0)
(102, 'suryansh', 30, 40000.0)

In [20]:
cursor.execute('''
    delete from employee
    where
    name='suryansh'
''')

connection.commit()

In [21]:
cursor.execute('Select * from employee')
rows = cursor.fetchall()

for row in rows:
    print(row)

(101, 'sumit', 30, 20000.0)

In [22]:
## To insert multiple data

data = [
    (102,'shubham',20,40000),
    (103,'dhuriya',25,50000),
    (104,'amit',30,60000)
]

cursor.executemany('''
        insert into employee(employee_id,name,age,salary)
        values(?,?,?,?)
''',data)

connection.commit()

In [23]:
cursor.execute('Select * from employee')
rows = cursor.fetchall()

for row in rows:
    print(row)

(101, 'sumit', 30, 20000.0)
(102, 'shubham', 20, 40000.0)
(103, 'dhuriya', 25, 50000.0)
(104, 'amit', 30, 60000.0)

In [24]:
# To close the connection

connection.close()